/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   syntax.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hshimizu <hshimizu@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/11/22 01:39:49 by hshimizu          #+#    #+#             */
/*   Updated: 2023/11/22 01:44:43 by hshimizu         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
よくわかんえねぇけど字句解析したやつをいじくるんだと思う
str: "cat"
str: "-e"
str: "文字列 mojiretu string"
が
cmd:	{"cat", "-e", "文字列 mojiretu string", NULL}

str: "echo"
str: "asd"
？: PIPE
str: "cat"
が
PIPE:	cmd:	{"echo", "asd", NULL}
		cmd:	{cat}
っていう感じなのにしたい？
*/